% 此为论文中，关于Fig5(a)中a子图的复现结果。
% 输入参数包括初始状态（位置）和图的拉普拉斯矩阵
% 最后显示状态一致性收敛的踪迹和输入的变化曲线
clc;
clear;

%% 输入初始化参数
X0  = [-10.2999, 0.2575, -4.4997, 3.6258, 3.0922, 9.0156, 3.5099, -2.6645, 2.4552, -4.4921]';
% 一致性决策值
AveVal = mean(X0);                                                          % 平均一致性
MaxVal = max(X0);                                                           % 最大一致性
MinVal = min(X0);                                                           % 最小一致性
n   = 10;                                                                   % 节点数量
% 度矩阵，有向拓扑结构
D =[1 0 0 0 0 0 0 0 0 0;
    0 1 0 0 0 0 0 0 0 0;
    0 0 1 0 0 0 0 0 0 0;
    0 0 0 1 0 0 0 0 0 0;
    0 0 0 0 1 0 0 0 0 0;
    0 0 0 0 0 1 0 0 0 0;
    0 0 0 0 0 0 1 0 0 0;
    0 0 0 0 0 0 0 1 0 0;
    0 0 0 0 0 0 0 0 1 0;
    0 0 0 0 0 0 0 0 0 1;];
% 邻接矩阵，有向拓扑结构
A =[0 1 0 0 0 0 0 0 0 0;
    0 0 1 0 0 0 0 0 0 0;
    0 0 0 1 0 0 0 0 0 0;
    0 0 0 0 1 0 0 0 0 0;
    0 0 0 0 0 1 0 0 0 0;
    0 0 0 0 0 0 1 0 0 0;
    0 0 0 0 0 0 0 1 0 0;
    0 0 0 0 0 0 0 0 1 0;
    0 0 0 0 0 0 0 0 0 1;
    1 0 0 0 0 0 0 0 0 0;];
% 度矩阵，有向拓扑结构
D =[1 0 0 0 0 0 0 0 0 0;
    0 2 0 0 0 0 0 0 0 0;
    0 0 2 0 0 0 0 0 0 0;
    0 0 0 2 0 0 0 0 0 0;
    0 0 0 0 1 0 0 0 0 0;
    0 0 0 0 0 2 0 0 0 0;
    0 0 0 0 0 0 1 0 0 0;
    0 0 0 0 0 0 0 2 0 0;
    0 0 0 0 0 0 0 0 1 0;
    0 0 0 0 0 0 0 0 0 2;];
% 邻接矩阵，有向拓扑结构
A =[0 1 0 0 0 0 0 0 0 0;
    0 0 1 0 0 0 0 0 0 1;
    0 0 0 1 0 0 0 1 0 0;
    0 0 0 0 1 1 0 0 0 0;
    0 0 0 0 0 1 0 0 0 0;
    0 0 0 1 0 0 1 0 0 0;
    0 0 0 0 0 0 0 1 0 0;
    0 0 1 0 0 0 0 0 1 0;
    0 0 0 0 0 0 0 0 0 1;
    1 1 0 0 0 0 0 0 0 0;];
% 度矩阵，有向拓扑结构
D =[2 0 0 0 0 0 0 0 0 0;
    0 1 0 0 0 0 0 0 0 0;
    0 0 1 0 0 0 0 0 0 0;
    0 0 0 2 0 0 0 0 0 0;
    0 0 0 0 1 0 0 0 0 0;
    0 0 0 0 0 1 0 0 0 0;
    0 0 0 0 0 0 1 0 0 0;
    0 0 0 0 0 0 0 2 0 0;
    0 0 0 0 0 0 0 0 2 0;
    0 0 0 0 0 0 0 0 0 1;];
% 邻接矩阵，有向拓扑结构
A =[0 1 0 0 0 0 0 0 1 0;
    0 0 1 0 0 0 0 0 0 0;
    0 0 0 1 0 0 0 0 0 0;
    0 0 0 0 1 0 0 1 0 0;
    0 0 0 0 0 1 0 0 0 0;
    0 0 0 0 0 0 1 0 0 0;
    0 0 0 0 0 0 0 1 0 0;
    0 0 0 1 0 0 0 0 1 0;
    1 0 0 0 0 0 0 0 0 1;
    1 0 0 0 0 0 0 0 0 0;];
% 度矩阵，有向拓扑结构
D =[2 0 0 0 0 0 0 0 0 0;
    0 2 0 0 0 0 0 0 0 0;
    0 0 1 0 0 0 0 0 0 0;
    0 0 0 2 0 0 0 0 0 0;
    0 0 0 0 2 0 0 0 0 0;
    0 0 0 0 0 1 0 0 0 0;
    0 0 0 0 0 0 2 0 0 0;
    0 0 0 0 0 0 0 3 0 0;
    0 0 0 0 0 0 0 0 2 0;
    0 0 0 0 0 0 0 0 0 1;];
% 邻接矩阵，有向拓扑结构
A =[0 1 0 0 0 0 0 0 1 0;
    0 0 1 0 0 0 0 1 0 0;
    0 0 0 1 0 0 0 0 0 0;
    0 0 0 0 1 0 0 1 0 0;
    0 0 0 0 0 1 1 0 0 0;
    0 0 0 0 0 0 1 0 0 0;
    0 0 0 0 1 0 0 1 0 0;
    0 1 0 1 0 0 0 0 1 0;
    1 0 0 0 0 0 0 0 0 1;
    1 0 0 0 0 0 0 0 0 0;];
% 拉普拉斯矩阵
L = D - A;

% 矩阵的代数连通度
eig_val = eig(L);                       % L的特征值
eig_val = sort(eig_val,'ascend');       % 从小到大排序，最小特征值为0
algeb_conn = eig_val(2);                % algebraic connectivity 代数连通度：lap_matrix的第二小特征值>0，连通图

%% 收敛相关参数
tBegin = 0;                                                                 % 开始时间 
tEnd   = 15;                                                                % 结束时间
h      = 0.1;                                                               % 最小时间间隔
times  = (tEnd-tBegin) / h;                                                 % 迭代计算次数
X(:,1) = X0;                                                                % X的第一列等于X1
U(:,1) = -L * X0;
t(1) = tBegin;                                                              % 时间间隔记录表

i = 1;
while(i <= times)
    Xt = X(:,i);
    Ut = -L * Xt;                                                           % u = -Lx
    Xt1 = Xt + h * Ut;                                                      % x = x + h*u
       
    X(:,i+1) = Xt1;                                                         % 添加更新后的Xt值
    U(:,i+1) = Ut;                                                          % 添加更新后的Ut值  
    t(i+1) = tBegin + i * h;                                                % 添加更新后的t值
    i = i+1;
end

%% 结果显示
% 绘制图像
subplot(2,1,1)
plot(t,X(1,:), t,X(2,:), t,X(3,:), t,X(4,:), t,X(5,:), t,X(6,:), t,X(7,:), t,X(8,:), t,X(9,:), t,X(10,:), 'linewidth',2.0)
% legend("x_1","x_2","x_3","x_4","x_5","x_6","x_7","x_8","x_9","x_{10}");
xlabel('Times/收敛次数');
ylabel('States/状态值');
title('States-Times');

subplot(2,1,2)
plot(t,U(1,:), t,U(2,:), t,U(3,:), t,U(4,:), t,U(5,:), t,U(6,:), t,U(7,:), t,U(8,:), t,U(9,:), t,U(10,:), 'linewidth',2.0)
% legend("u_1","u_2","u_3","u_4","u_5","u_6","u_7","u_8","u_9","u_{10}");
xlabel('Times/收敛次数');
ylabel('U/输入值');
title('U-Times');


